public/project/launch-club/index.html
<!DOCTYPE html>
<html lang="en-us" dir="ltr">
<head>  <meta charset="utf-8" />
<meta name="viewport" content="width=device-width" />
<link
  rel="icon"
  type="image/png"
  href="http://localhost:1313/porfolio-hugo//icons/favicon-96x96.png"
  sizes="96x96"
/>
<link
  rel="icon"
  type="image/svg+xml"
  href="http://localhost:1313/porfolio-hugo//icons/favicon.svg"
/>
<link rel="shortcut icon" href="http://localhost:1313/porfolio-hugo//icons/favicon.ico" />
<link
  rel="apple-touch-icon"
  sizes="180x180"
  href="http://localhost:1313/porfolio-hugo//icons/apple-touch-icon.png"
/>
<link rel="manifest" href="http://localhost:1313/porfolio-hugo//icons/site.webmanifest" />
<title>
  Launch Club | Software Engineering Portfolio
</title>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/normalize.css" />

    <link rel="stylesheet" href="/porfolio-hugo/css/main.css">
 


</head>
<body>
  <header>
    <a href="http://localhost:1313/porfolio-hugo/">
  <h3>Software Engineering Portfolio</h3>
</a>

  </header>
  <main>
    
<section>
  <main style="line-height: 1.5; max-width: 678px">
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Developing an Engaging Fitness Facility Website: LaunchClub.com
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Overview
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Launch Club is a fitness facility in Minneapolis seeking to improve customer engagement through an updated website. My client needed a refreshed design and user experience for their WordPress site to drive customer adoption and enhance overall usability. The project involved updating content, redesigning pages, and integrating external services for seamless user interaction.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Challenges
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li>The existing WordPress site had outdated content and a cumbersome user experience, leading to reduced customer engagement.</li>
<li>The site lacked critical features such as tier-based scheduling and payment integration, essential for managing memberships and reservations.</li>
<li>UI components were inconsistent and failed to provide an engaging user experience.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Solutions
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li>Conducted a detailed analysis of the existing site to identify pain points and areas of improvement.</li>
<li>Collaborated closely with the client to understand business goals and user requirements.</li>
<li>Designed a streamlined interface to ensure intuitive navigation and clear calls to action.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Implementation
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ul>
<li>Used HTML, CSS, and JavaScript to build and update pages, ensuring responsive design across devices.</li>
<li>Integrated the GymMaster scheduling application to handle tier-based reservations and payments, enhancing the customer booking experience.</li>
<li>
<p>Designed and deployed UI components, including:</p>
<ul>
<li>Simple banners for announcements and promotions.</li>
<li>Animated media players to showcase video content effectively.</li>
<li>Complex data intake forms for capturing detailed customer information.</li>
</ul>
</li>
<li>Thoroughly tested all updates to ensure functionality, usability, and performance before deployment.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Technologies Used
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<ul>
<li><strong><strong>Frontend Development:</strong></strong> HTML, CSS, JavaScript</li>
<li><strong><strong>Backend and CMS:</strong></strong> WordPress</li>
<li><strong><strong>Integration Services:</strong></strong> GymMaster</li>
<li><strong><strong>Tools:</strong></strong> Figma for wireframing and design, browser developer tools for debugging</li>
</ul>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Conclusion
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>The updated Launch Club website successfully addressed the client’s goals, providing a refreshed look and improved functionality. Customer feedback highlighted the ease of navigation and enhanced user experience, while the GymMaster integration simplified scheduling and payments. This project demonstrates my ability to redesign and implement web solutions tailored to client needs, driving user engagement and business growth.</p>
</div>
</div>
</div>
</div>
</main>
</section>

  </main>
  <footer>
    <p>Copyright 2025. All rights reserved.</p>

  </footer>
</body>
</html>
